import pandas as pd

ls1 = [1,2,3,4,5]
ls2 = [6,7,8,9,10]
zp = zip(ls1, ls2)
dt = dict(zp)
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
# print(data)
df = pd.DataFrame(data, index=["서울", "부산", "인천", "대구"], columns=["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"])
# print(df.values)
print(pd.DataFrame.from_dict(data))
